{
    "title":"how to code in python",
    "description":"Python is a multi-paradigm programming language. Object-oriented programming and structured programming are fully supported, and many of its features support functional programming and aspect-oriented programming (including metaprogramming61 and metaobjects [magic methods] ).62 Many other paradigms are supported via extensions, including design by contract63 64 and logic programming.65 Python uses dynamic typing and a combination of reference counting and a cycle-detecting garbage collector for memory management.66 It uses dynamic name resolution (late binding), which binds method and variable names during program execution. Its design offers some support for functional programming in the Lisp tradition. It has filter,mapandreduce functions; list comprehensions, dictionaries, sets, and generator expressions.67 The standard library has two modules (itertools and functools) that implement functional tools borrowed from Haskell and Standard ML.68 Its core philosophy is summarized in the document The Zen of Python (PEP 20), which includes aphorisms such as:69 Beautiful is better than ugly. Explicit is better than implicit. Simple is better than complex. Complex is better than complicated. Readability counts. Rather than building all of its functionality into its core, Python was designed to be highly extensible via modules. This compact modularity has made it particularly popular as a means of adding programmable interfaces to existing applications. Van Rossum's vision of a small core language with a large standard library and easily extensible interpreter stemmed from his frustrations with ABC, which espoused the opposite approach.40 Python strives for a simpler, less-cluttered syntax and grammar while giving developers a choice in their coding methodology. In contrast to Perl's  motto, Python embraces a philosophy.69 Alex Martelli, a Fellow at the Python Software Foundation and Python book author, wrote: ",
    "author":"Priyam Srivastava",
    "date":"2020-01-01",
    "tags":["python","programming","tutorial"],
    "slug":"how-to-code-in-python"

}